[
    {
      "_id": "r1",
      "title": "BENGALI ROSHOMALI",
      "img": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Ras-Malai.jpg",
      "chefName": "Kashem Natori",
      "ingredients": {
        "ingredient1": "Milk",
        "ingredient2": "Suger",
        "ingredient3": "Water",
        "ingredient4": "Yogurt",
        "ingredient5": "Ice"
      },
      "chefImg": "https://img001.prntscr.com/file/img001/pWb1E_SNSS6JzPWgpEWXkg.jpg",
      "chefExperience": "15 yrs",
      "likes": 250,
      "description": "In a large dutch oven over high heat, bring milk to a boil. Once the milk starts bubbling away, add yogurt. As soon as the milk curdles, pour ice water to stop the cooking process. Wash the curds twice and let it strain in a cheese cloth for 30 minutes. In a separate dutch oven. bring the water to a boil, then add sugar. Don’t let it turn to a thick syrup. Just let the sugar dissolve. Add the cheese balls, cover the lid and boil in high heat for 5 minutes. Then turn down to a medium-high heat, keep the lid covered. After 15 minutes, turn off the heat and let the cheese balls soak in the syrup for an hour. In a really large dutch oven, over medium-low heat, gently reduce the milk for 1.5 hours. Stir every now and then to make sure it's not getting scorched on the bottom of the pan. As it cooks, skim and discard the skin that forms on the top of the milk.",
      "numRecipes": 50
    },
    {
      "_id": "c9",
      "title": "BENGALI KALO JAM",
      "ingredients": {
        "ingredient1": "Milk",
        "ingredient2": "Water",
        "ingredient3": "Suger",
        "ingredient4": "Semolina",
        "ingredient5": "Nutmeg"
      },
      "img": "https://static.toiimg.com/thumb/53284860.cms?width=1200&height=900",
      "chefName": "Joshim Hawladar",
      "chefImg": "https://nationaltoday.com/wp-content/uploads/2021/07/shutterstock_1518533924-min.jpg",
      "chefExperience": "20 yrs",
      "likes": 400,
      "description": "1. First put a sauce pan on heat with 4 cups water, sugar and mace. When sugar is melt and syrup comes into boiling point boiling point, turn off the heat. Keep aside. We need lukewarm syrup to soak the sweet.2. Mix milk powder, self raising flour, semolina, nutmeg, sugar and cream. Add thicken cream little by little and crumble it up. Don’t make it soft. It will nt be like dough. It will be like crumbly cheese (chana).3. Divide the dough into 16-18 balls and make each into cylinder shape.4. Heat the pan on medium with oil for deep fry. When I say deep fry that it means enough oil to deep the sweet while frying. Check the oil to put a little piece of dough in the oil if it sizzles and comes up slowly .",
      "numRecipes": 75
    },
    {
      "_id": "d2",
      "title": "BENGALI FISH CURRY",
      "ingredients": {
        "ingredient1": "Fish",
        "ingredient2": "Sorisa",
        "ingredient3": "Oil",
        "ingredient4": "Onion",
        "ingredient5": "Water"
      },
      "img": "https://somethingiscooking.com/wp-content/uploads/2017/01/BengaliFishCurry2.jpg",
      "chefName": "Jamila Ansari",
      "chefImg": "https://st2.depositphotos.com/1518767/11292/i/450/depositphotos_112927756-stock-photo-happy-chef-making-ok-sign.jpg",
      "chefExperience": "25 yrs",
      "likes": 300,
      "description": "Marinate the fish pieces in turmeric and salt. Blend tomatoes, garlic, green chillies and powdered mustard seeds and add to the pan with mustard oil. Cook till excess water is evaporated and oil is released. Add water and simmer. Pan fry the marinated fish pieces. Fry on both sides and add to mustard gravy. You will notice a slight difference in ingredients between this and the previous version of ilish bhaja that we shared. When it comes to frying hilsa, the idea is to keep the preparation very simple. You are to highlight it’s unique flavor and delectable texture by using minimal spices. BUT there is a catch — ilish is usually imported from Bangladesh and the process involves freezing the fish for preservation.",
      "numRecipes": 60
    },
    {
      "_id": "p7",
      "title": "BENGALI MUTTON CURRY",
      "img": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/pal.rini1-gmail.com/Mangsher_Jhol_Bengali_Style_Mutton_Curry.jpg",
      "chefName": "Khoibor Saha",
      "ingredients": {
        "ingredient1": "Mutton",
        "ingredient2": "Dry Chili",
        "ingredient3": "Potato",
        "ingredient4": "Onion",
        "ingredient5": "Oil"
      },
      "chefImg": "https://panlasangpinoy.com/wp-content/uploads/2016/05/what-is-a-chef-de-cuisiine.jpg",
      "chefExperience": "30 yrs",
      "likes": 500,
      "description": "‘Mangsher Jhol’ and Sundays are synonymous in Bengali kitchen. I remember my childhood days when Sunday used to be dance classes in the morning, ‘Tekona Porota’ and ‘Aloo Chorchori’ for breakfast or ‘Luchi-Sada Aloor Chorchori’ for breakfast and Chicken Curry or Mutton Curry for lunch was a must. I still remember when Maa used to grind the masalas in ‘shil-nora’ (a traditional way of grinding spices with the help of a oblong stone piece on a large stone square piece). And the flavour or freshly ground spices were unparalleled to any branded spice powder.",
      "numRecipes": 80
    },
    {
      "_id": "s3",
      "title": "BENGALI ILISH BHAJA",
      "ingredients": {
        "ingredient1": "Ilish Fish",
        "ingredient2": "Dry Chili",
        "ingredient3": "Sorisa",
        "ingredient4": "Onion",
        "ingredient5": "Oil"
      },
      "img": "https://images.squarespace-cdn.com/content/v1/5ea5f3913b0ccf06d0ec2563/1650301004598-0XTYSZ156CN76G7BBCCF/TSO_Ilish+Bhaja_4x3.jpg",
      "chefName": "Mopela Khatun",
      "chefImg": "https://hendi.xcdn.nl/RM700,700/-/560044_12-2021-aj.jpg",
      "chefExperience": "10 yrs",
      "likes": 200,
      "description": "You will notice a slight difference in ingredients between this and the previous version of ilish bhaja that we shared. When it comes to frying hilsa, the idea is to keep the preparation very simple. You are to highlight it’s unique flavor and delectable texture by using minimal spices. BUT there is a catch — ilish is usually imported from Bangladesh and the process involves freezing the fish for preservation. When buying it, make sure to read the packaging and try to buy from the newest batch available in the freezer section. It also helps to communicate and be in good terms with your local Bengali grocery store owner, just saying! ",
      "numRecipes": 40
    },
    {
      "_id": "t8",
      "title": "BENGALI MOONG DAL",
      "ingredients": {
        "ingredient1": "Dal",
        "ingredient2": "Dry Chili",
        "ingredient3": "Potato",
        "ingredient4": "Onion",
        "ingredient5": "Oil"
      },
      "img": "https://www.scratchingcanvas.com/wp-content/uploads/2018/03/Tetor-Dal.2.jpg",
      "chefName": "Kolaboti Pepe Khatun",
      "chefImg": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTqeiT9t1HxkG1exALnJ3fZTGfTzgtBphb8b4tYtvitk_YoEMOLZaQPEQM1ZQXAw2AMmSU&usqp=CAU",
      "chefExperience": "5 yrs",
      "likes": 150,
      "description": "Chook mong dal will notice a slight difference in ingredients between this and the previous version of ilish bhaja that we shared. When it comes to frying hilsa, the idea is to keep the preparation very simple. You are to highlight it’s unique flavor and delectable texture by using minimal spices. BUT there is a catch — ilish is usually imported from Bangladesh and the process involves freezing the fish for preservation. When buying it, make sure to read the packaging and try to buy from the newest batch available in the freezer section. It also helps to communicate and be in good terms with your local Bengali grocery store owner, just saying!",
      "numRecipes": 30
    },
    {
      "_id": "b4",
      "title": "BENGALI MATAR GHUGNI",
      "ingredients": {
        "ingredient1": "Matar",
        "ingredient2": "Dry Chili",
        "ingredient3": "Potato",
        "ingredient4": "Onion",
        "ingredient5": "Oil"
      },
      "img": "https://rumkisgoldenspoon.com/wp-content/uploads/2021/03/Ghugni-recipe.jpg",
      "chefName": "Kutkuti Begom",
      "chefImg": "https://thumbs.dreamstime.com/b/female-chef-kitchen-portrait-smiling-hands-crossed-33838375.jpg",
      "chefExperience": "2 yrs",
      "likes": 100,
      "description": "Ghugni recipe aka ghugni recipe Bengali is a scrumptious, flavoured yellow peas curry which is counted as one of most beloved Kolkata street food like Phuchka, veg chop, egg roll etc. It is an immensely popular Bengali snack recipe which is sold in almost every corner of Bengal, starting from the street food vendors to the popular restaurants. In this preparation, boiled yellow peas or white peas are cooked with onion, tomato, potato chunks and Bengali spice mix bhaja masala. Ghugni matar is mostly served with some chopped onion, green chillies and few drops of lemon juice as snacks or simply as side with luchi for breakfast.",
      "numRecipes": 20
    }
]